[
    {
        "id": 1,
        "name": "Empty Template",
        "description": "Start with nothing.",
        "content": ""
    },
    {
        "id": 2,
        "name": "Verse-by-Verse Running Commentary",
        "description": "This template is designed to help pastors work verse-by-verse through their text.",
        "content": "<h1>Sermon Title</h1><p>Bible passage(s)</p><p>Big idea of message</p><h3>Introduction</h3><h3>Passage background and context information</h3><h2>1. First Set of Verses</h2><h3>Explain the text</h3><h3>Illustrate the text</h3><h2>2. Second Set of Verses</h2><h3>Explain the text</h3><h3>Illustrate the text</h3><h2>3. Third Set of Verses</h2><h3>Explain the text</h3><h3>Illustrate the text</h3><h3>Apply the passage</h3><h3>Conclusion</h3>"
    },
    {
        "id": 4,
        "name": "Traditional 3-point sermon",
        "description": "Divide your sermon into 3 main sections; 1.) A welcome/introduction, 2.) A main body, and 3.) A conclusion/application",
        "why": "<p>The 3-point sermon expands upon a ‘main idea’ within the body of the sermon by utilizing,<em>3 points. </em>You can insert sub points as emphasis or explanation, which is part of the beauty of building a sermon in this way.</p><p>Also worth noting, whether you are preaching verse by verse, from a lectionary reading, or on a specific topic, the 3-point sermon is flexible to fit around most any preaching style.</p>",
        "content": "<h1>Welcome and Introduction</h1><ol><li>Use this section to welcome the congregation. You may want to introduce yourself so that guests know who you are and what your position is within the church.<li>Introduce the passage or topic for the morning. Give some direction as to where you’ll be going and what the congregation can expect.</ol><h1>Main Body</h1><ol><li>This is where you get into the passage or topic for the morning.<li>When you have your big idea or theme for the sermon you can then delineate the 3-points. As an example if you are preaching on the baptism of Jesus from Mark 1:9-13 your big idea may simply be, “Jesus got baptized” Your 3 points could then be:<li class=ql-indent-1>Why baptism is important<li class=ql-indent-1>What happens during baptism<li class=ql-indent-1>Who can be baptised<li>As mentioned above, one of the beauties of a 3-point sermon is that you can add sub points under any one of the main points.</ol><h1>Conclusion/application</h1><ol><li>Use this section to re-emphasize your main point. Repetition is a key component of retention.<li>Give the congregation some points of application so that people have answers to the question, “now what” after hearing the sermon.<li class=ql-indent-1>For example. If the sermon was on baptism you could;<li class=ql-indent-2>Have a sign up available for the next baptism.<li class=ql-indent-2>Invite people with more questions to a lunch after service.<li class=ql-indent-2>Have a pool ready and invite people to be baptized.<li>Finish the service with prayer and announcements.</ol>"
    },
    {
        "id": 3,
        "name": "The ME-WE-GOD-YOU-WE Method",
        "description": "Created by Andy Stanley, this preaching outline uses a simple formula to communicate the text’s big idea in a conversational manner.",
        "content": "<h1>Sermon Title</h1><p>Bible passage(s)</p><p>Big idea of message</p><h2>1. Me</h2><h3>How do I struggle with this?</h3><p>Here, the communicator introduces a dilemma they have faced or are currently facing.</p><h2>2. We</h2><h3>How do we all struggle with this?</h3><p>Find common ground with your audience around the same or similar dilemma</p><h2>3. God</h2><h3>What does the Bible say about this?</h3><p>Transition to the text to discover what God says about the tension or question you’ve introduced.</p><h2>4. You</h2><h3>What should you do about this?</h3><p>Challenge your audience to act on what they’ve just heard</p><h2>5. We</h2><h3>How can we all live this out together?</h3><p>Close with several statements about what could happen in your community, your church, or the world if everybody embraced that particular truth.</p>"
    },    
    {
        "id": 5,
        "name": "Wedding Ceremony",
        "description": "Perfect for delivering a lasting message for the bride and groom",
        "why": "<p>Officiating a wedding is an incredible honor. It can also cause quite a bit of anxiety for the officiant who rarely performs a wedding. We’ve put together a wedding template to help guide your preparation and ease the potential stress.</p><p>**Remember to check state and local requirements for wedding licensure and format. Make sure the bride and groom get their wedding license before the ceremony.**</p>",
        "content": "<ol><li>Entrance  of Pastor,  Groom & Wedding  Party.<li>Father of Bride “hands off” bride to groom<li class=ql-indent-1>“Who gives this woman to be married to this man?”<li>Greet the guests and offer a prayer to signify the ‘beginning’ of the ceremony<li class=ql-indent-1>“On behalf of the bride and groom thank you for coming…”<li class=ql-indent-1>Prayer Offering.<li class=ql-indent-1>Invite guests to be seated<li>Invocation (The “I-Do” section)<li class=ql-indent-1>(Groom name) do you wish to be joined today in marriage to (Bride name)? If so, please respond by saying, “I-Do”.<li class=ql-indent-1>(Bride name) do you wish to be joined today in marriage to (Groom name)? If so, please respond by saying, “I-Do”.<li class=ql-indent-1>Many ceremonies invite the congregation to share their support for the couple by also responding, “I-Do” to a prompt that may sound something like this - “Family and Friends, do you commit yourselves in prayer and support of this young couple throughout their marriage?”<li>Minister’s words on marriage.<li class=ql-indent-1>This section could be seen as the ‘sermon’ portion of the wedding. Some ideas to help guide the time here;<li class=ql-indent-2>Ask the bride and groom if there are specific passages of scripture that have been influential or encouraging through their relationship.<li class=ql-indent-2>Song of Songs is a great book to get wedding inspiration<li class=ql-indent-2>1 Corinthians 13, “The Love Chapter”, is popular at weddings.<li class=ql-indent-2>Make the sermon personal. If possible take time to speak encouragement over both the bride and groom.<li class=ql-indent-2>Remember that as much as this is a public time of celebration this is also a very intimate time between the bride, groom, and Christ.<li>Exchange of Vows<li class=ql-indent-1>Many couples write their own vows to share. Make sure to have an extra copy on hand if they do their own in the event that the originals are lost.<li class=ql-indent-1>You can find a whole list of ‘traditional vows’ through a simple Google search or encourage the bride and groom to do a search themselves and give you an example of the one they want to use.<li>Ring Exchange<li class=ql-indent-1>Similar to the exchange of vows, some couple will write their own words to share during the ring exchange or they may take a more traditional approach.<li class=ql-indent-2>Make sure you know where the rings are coming from and accounted for before the service begins.<li>After the ring exchange there is a multitude of things that <em style=background-color:transparent>could </em>happen. (The important thing to do as a minister is to discuss options with the couple and then be available to make them happen during the ceremony.);<li class=ql-indent-1>The couple shares in communion together.<li class=ql-indent-1>The couple washes each other’s feet.<li class=ql-indent-1>Unity candle where separate candles are used to light one main candle.<li class=ql-indent-1>Songs are sung or music played.<li class=ql-indent-1>The couple receives prayer from parents.<li class=ql-indent-1>“Sand ceremony” where 2 different colors of sand are poured into one vessel.<li class=ql-indent-1>Planting of a tree together.<li class=ql-indent-1>Etc, etc, etc…<li>Offer a closing prayer (This can help to symbolize the ‘close’ of the ceremony)<li>Pronouncement and Kiss<li class=ql-indent-1>“By the power vested in me, I now pronounce you man and wife… You may kiss your bride.”<li>Introduction of couple<li class=ql-indent-1>“It is my great honor to introduce to you for the first time, “Mister and Misses _________” (Music begins playing and the entire wedding party exits.)</ol><p> <p>P.S. - Remember to get instructions from the bride or wedding planner as to what needs to happen directly after the ceremony. The minister is usually responsible for giving instructions to the congregation and setting a good expectation for what is happening next.<p> <p>P.P.S. - Don’t forget to sign the wedding license with the bride and groom."
    }
]

